Revit 2027 API
ExternalDataManagerCommand.Name Property
 The name of the command.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
member Name : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The command name will be shown in UI, so it should be localized.
See Also
Reference
ExternalDataManagerCommand Class
Autodesk.Revit.UI Namespace